Repository: codeinplace2020/SectionHandouts
Catalog: locale/*/LC_MESSAGES/section1/section1.po
Languages: de_de, es_es, fr_fr

source: Section Handout 1
de_de: Abschnitt Handout 1
es_es: Hoja informativa 1
fr_fr: Document de section 1

source: United Nations Karel
de_de: Karel der Vereinten Nationen
es_es: Karel de las Naciones Unidas
fr_fr: Nations Unies Karel

source: As part of its plans to help reconstruct infrastructure worldwide, the United Nations - that's right, the UN is using Karel - established a new program with the mission of dispatching house-building robots to repair flood-damaged areas.
de_de: Im Rahmen ihrer Pläne, den weltweiten Wiederaufbau der Infrastruktur zu unterstützen, haben die Vereinten Nationen - das ist richtig, die UN nutzen Karel - ein neues Programm mit dem Auftrag eingerichtet, Hausbauroboter zur Reparatur von Hochwassergebieten zu entsenden.
es_es: Para reconstruir la infraestructura del mundo, las Naciones Unidas - es cierto, la ONU utiliza Karel - estableció un nuevo programa con la intención de enviar robots de construcción de viviendas para reparar áreas dañadas por las inundaciones.
fr_fr: Dans le cadre de ses plans pour aider à reconstruire les infrastructures dans le monde, les Nations Unies - c’est vrai, l’ONU utilise Karel - ont établi un nouveau programme avec pour mission d’envoyer des robots de construction de maisons pour réparer les zones endommagées par les inondations.

source: Your job is to program those robots.
de_de: Ihre Aufgabe ist es, diese Roboter zu programmieren.
es_es: Su trabajo es programar esos robots.
fr_fr: Votre travail consiste à programmer ces robots.

source: Each robot begins at the west end of a street that might look like this:
de_de: Jeder Roboter beginnt am westlichen Ende einer Straße, die folgendermaßen aussehen könnte:
es_es: Cada robot empieza en el extremo oeste de una calle que podría verse así:
fr_fr: Chaque robot commence à l’extrémité ouest d’une rue qui pourrait ressembler à ceci:

source: Each beeper in the figure represents a pile of debris. Karel's job is to walk along the street and build a new house in the places marked by each beeper. Those houses, moreover, need to be raised on stilts to avoid damage from the next flood. Each house, in fact, should look exactly like the picture below:
de_de: Jeder Piepser in der Abbildung repräsentiert einen Trümmerhaufen. Karels Aufgabe ist es, die Straße entlang zu gehen und an den von jedem Piepser markierten Stellen ein neues Haus zu bauen. Darüber hinaus müssen diese Häuser auf Stelzen errichtet werden, um Schäden durch die nächste Flut zu vermeiden. Tatsächlich sollte jedes Haus genau wie auf dem Bild unten aussehen:
es_es: Cada bíper en la figura representa una montaña de escombros. Karel tendrá que andar por la calle y construir una casita nueva en los lugares marcados por cada bíper. Esas casas, además, tienen que ser levantadas sobre pilotes para evitar dañarse durante la próxima inundación. Cada casa, de hecho, debe verse exactamente como la siguiente imagen:
fr_fr: Chaque bip de la figure représente un tas de débris. Le travail de Karel est de marcher le long de la rue et de construire une nouvelle maison aux endroits marqués par chaque bip. De plus, ces maisons doivent être surélevées sur pilotis pour éviter les dommages causés par la prochaine inondation. En fait, chaque maison devrait ressembler exactement à l’image ci-dessous:

source: The new house should be centered at the point at which the bit of debris was left, which means that the first house in the diagram above will be constructed with its left edge along 2nd Avenue. At the end of the run, Karel should be at the east end of the street having created a set of houses that look like this for the initial conditions shown:
de_de: Das neue Haus sollte an der Stelle zentriert sein, an der die Trümmer zurückgelassen wurden. Dies bedeutet, dass das erste Haus im obigen Diagramm mit dem linken Rand entlang der 2nd Avenue gebaut wird. Am Ende des Laufs sollte Karel am östlichen Ende der Straße sein und eine Reihe von Häusern erstellt haben, die für die gezeigten Anfangsbedingungen so aussehen:
es_es: La nueva casa debe estar centrada en el punto en el que quedaron los restos, lo que significa que la primera casa en el diagrama anterior se construirá con su borde izquierdo a lo largo de la 2a avenida. Al final de la ejecución, Karel debería estar en el extremo este de la calle, habiendo creado un conjunto de casas que se vean así para las condiciones iniciales mostradas:
fr_fr: La nouvelle maison doit être centrée au point où le morceau de débris a été laissé, ce qui signifie que la première maison dans le diagramme ci-dessus sera construite avec son bord gauche le long de la 2e Avenue. À la fin de la course, Karel devrait être à l’extrémité est de la rue après avoir créé un ensemble de maisons qui ressemblent à ceci pour les conditions initiales indiquées:

source: Keep in mind the following information about the world:
de_de: Beachten Sie die folgenden Informationen über die Welt:
es_es: Tenga en cuenta la siguiente información sobre el mundo:
fr_fr: Gardez à l’esprit les informations suivantes sur le monde:

source: Karel starts facing east at (1, 1) with an infinite number of beepers in its beeper bag.
de_de: Karel beginnt bei (1, 1) mit einer unendlichen Anzahl von Pieptönen in seiner Piepsertasche nach Osten zu schauen.
es_es: Karel comienza frente al este en la posición (1, 1) con un número infinito de bíperes en su bolsa.
fr_fr: Karel commence face à l’est à (1, 1) avec un nombre infini de bips dans son sac de beeper.

source: The beepers indicating the positions at which houses should be built will be spaced so that there is room to build the houses without overlapping or hitting walls.
de_de: Die Piepser, die die Positionen angeben, an denen Häuser gebaut werden sollen, sind so beabstandet, dass Platz zum Bauen der Häuser vorhanden ist, ohne dass sich Wände überlappen oder treffen.
es_es: Los bíperes que indican las posiciones en las que se deben construir las casas estarán espaciados para que haya espacio para construir las casas sin superponerse o chocar con las paredes.
fr_fr: Les avertisseurs sonores indiquant les emplacements où les maisons doivent être construites seront espacés de manière à ce qu’il y ait de la place pour construire les maisons sans se chevaucher ou heurter les murs.

source: Karel must end up facing east at the southeast corner of the world. Moreover, Karel should not run into a wall if it builds a house that extends into that final corner.
de_de: Karel muss an der südöstlichen Ecke der Welt nach Osten schauen. Außerdem sollte Karel nicht gegen eine Mauer stoßen, wenn er ein Haus baut, das bis in diese letzte Ecke reicht.
es_es: Karel debe terminar de cara al este en la esquina sureste del mundo. Además, Karel no debería chocarse con una pared si construye una casa que se extienda hasta aquella esquina final.
fr_fr: Karel doit finir face à l’est à l’angle sud-est du monde. De plus, Karel ne devrait pas se heurter à un mur s’il construit une maison qui se prolonge dans ce dernier coin.

source: Write a program to implement the United Nations Karel project. Remember that your program should work for any world that meets the above conditions.
de_de: Schreiben Sie ein Programm zur Umsetzung des Karel-Projekts der Vereinten Nationen. Denken Sie daran, dass Ihr Programm für jede Welt funktionieren sollte, die die oben genannten Bedingungen erfüllt.
es_es: Escriba un programa para implementar el proyecto Karel de las Naciones Unidas. Recuerde que su programa debería funcionar para cualquier mundo que cumpla con las condiciones anteriores.
fr_fr: Rédiger un programme pour mettre en œuvre le projet Karel des Nations Unies. N’oubliez pas que votre programme devrait fonctionner pour tout monde qui remplit les conditions ci-dessus.
